<template>
  <div id="scroll-board">
    <dv-scroll-board :config="config" />
  </div>
</template>

<script>
export default {
  name: "BottomRight2",
  data() {
    return {
      config: {
        header: ["日期", "故障类型", "故障描述", "处理方法"],
        data: [
          ["2019-07-01", "效果问题", "打印模糊", "激光器故障明天处理"],
          ["2019-07-02", "卡纸", "无论打什么颜色都是花的", "更换黑色硒鼓"],
          [
            "2019-07-03",
            "出故障代码 ,开机没反应",
            "打印出的纸张有黑点、重影",
            "添加115克黄色载体，更换红色3600搓纸轮",
          ],
          [
            "2019-07-04",
            "效果问题",
            "路基危害-防尘网",
            "电源线坏了，更换了纸盒搓纸轮",
          ],
          [
            "2019-07-05",
            "效果问题,打印纸张不清楚",
            "黄色显影缺载体",
            "xxxxxxx",
          ],
          [
            "2019-07-06",
            "卡纸,出故障代码",
            "经常复印卡纸",
            "更换黑色鼓组淘宝的",
          ],
          [
            "2019-07-07",
            "声音问题",
            "打印有线",
            "硒鼓寿命到期，2024年12.31。已经屏蔽提示。",
          ],
          [
            "2019-07-08",
            "开机没反应",
            "更换转印带",
            "定影上辊及轴套老化需要订备件更换",
          ],
          ["2019-07-09", "效果问题", "打印偶尔底灰线条", "更换DR215黑色"],
          [
            "2019-07-10",
            "效果问题",
            "输稿器卡纸报错66-03 ,解决是去发现纸张带静",
            "进维修模式打代码清除报错",
          ],
          [
            "2019-07-08",
            "开机没反应",
            "更换转印带",
            "定影上辊及轴套老化需要订备件更换",
          ],
          ["2019-07-09", "效果问题", "打印偶尔底灰线条", "更换DR215黑色"],
          [
            "2019-07-10",
            "效果问题",
            "输稿器卡纸报错66-03 ,解决是去发现纸张带静",
            "进维修模式打代码清除报错",
          ],
          [
            "2019-07-08",
            "开机没反应",
            "更换转印带",
            "定影上辊及轴套老化需要订备件更换",
          ],
          ["2019-07-09", "效果问题", "打印偶尔底灰线条", "更换DR215黑色"],
          [
            "2019-07-10",
            "效果问题",
            "输稿器卡纸报错66-03 ,解决是去发现纸张带静",
            "进维修模式打代码清除报错",
          ],
        ],
        index: true,
        columnWidth: [50, 95, 120, 240, 200],
        align: ["center"],
        rowNum: 10,
        headerHeight: 45,
        headerBGC: "rgba(9, 37, 50, 0.4)",
        oddRowBGC: "rgba(9, 37, 50, 0.4)",
        evenRowBGC: "rgba(10, 32, 50, 0.3)",
      },
    };
  },
};
</script>

<style lang="less" scoped>
#scroll-board {
  width: 70%;
  box-sizing: border-box;
  margin-left: 10px;
  height: 100%;
  overflow: hidden;
}
</style>
